# IFC_ExportNoUI

## Description
Exports IFC file, without showing Export IFC Project dialog.

```pascal
FUNCTION IFC_ExportNoUI(strFullFilePath : DYNARRAY[] of CHAR) : BOOLEAN;
```

```python

def vs.IFC_ExportNoUI(strFullFilePath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strFullFilePath|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2021
## Category
* IFC